src/Documents/КассоваяСмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>КассоваяСмена</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоКассовойСмены</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеКассовойСмены</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусыКассовойСмены</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыКассовойСмены</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/AccumulationRegisters/РасчетыПоЭквайрингу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>РасчетыПоЭквайрингу</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭквайринговыйТерминал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭквайринговыеТерминалы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПлатежнойКарты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерПлатежнойКарты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>22</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаПлатежа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/AccumulationRegisters/ДенежныеСредства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ДенежныеСредства</Name>
			<Comment>Денежные средства</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Статья</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>БанковскийСчетКасса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ЭквайринговыеТерминалы</v8:Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/Enums/ВидыОпераций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыОпераций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВводОстатков</Name>
					<Comment>Ввод остатков</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзносНаЛицевойСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзносУчредителя</Name>
					<Comment>Взнос учредителя</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Возврат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратЗайма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратЗаработнойПлаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратНалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОплатыКлиенту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОплатыОтПоставщика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОплатыСтраховойКомпании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОтПодотчетника</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОтСотрудника</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОшибочнойОплатыКлиенту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратСЛицевогоСчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыбытиеВКассу</Name>
					<Comment>Для фин. операций. Отправка банком ден. средств в организацию</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаЗайма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаПодотчетнику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатаДивидендовУчредителю</Name>
					<Comment>ВыплатаДивидендовУчредителю</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатаЗаработнойПлаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗачислениеСертификата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеБонусныйСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаНалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаОтКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаОтСтраховойКомпании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаСотруднику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремещениеМеждуСкладами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремещенияМеждуСотрудниками</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСкладу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСотруднику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеИзБанка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеИзКассы</Name>
					<Comment>Для фин. операций. Поступление фиксация поступления ден. средств в банк </Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеОтЭквайера</Name>
					<Comment>Поступление от эквайера</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продажа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочееПоступление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочееСписание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СдачаНаличныхВБанк</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеБонусныйСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеРозничнойВыручкиИзОперационнойКассы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеИзКассыПредприятия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СдачаРозничнойВыручкиВКассуПредприятия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыбытиеВОперационнуюКассу</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/СтатусыКассовойСмены.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СтатусыКассовойСмены</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Открыта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗакрытаЧекиЗаархивированы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ТипыДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыДенежныхСредств</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Наличные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Безналичные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Comment>Денежные средства на лицевом счете</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлатежнаяКарта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодарочныйСертификат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Аванс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереводыВПути</Name>
					<Comment>Для фин. операций передачи денег из организации в банк</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БонусныйСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СистемаБыстрыхПлатежей</Name>
					<Comment>Для СБП и ссылок на оплату</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/ЭквайринговыеТерминалы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ЭквайринговыеТерминалы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>БанковскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЛицевогоСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЛицевыхСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьБезПодключенияОборудования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьОплатуПоСсылке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСинхронизации</Name>
					<Comment>Код синхронизации с ID загружаемой базы</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДоговора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрыПлатежногоШлюза</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодключаемоеОборудование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодключаемоеОборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентКомиссии</Name>
					<Comment>Процент комиссии</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипБанка</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПлатежныеШлюзы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипФискализации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыФискализации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЭквайринга</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЭквайринговыхТерминалов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Шаблон</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Эквайер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КассовыйСервер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодключаемоеОборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Documents/КассоваяСмена/Forms/ФормаУправленияКассовойСменой/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура - обработчик события "ПриСозданииНаСервере".
//
// Параметры:
//  Отказ				 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
			
	СтруктурнаяЕдиница = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;
	РабочееМесто       = ПараметрыСеанса.РабочееМестоКлиента;
	
	Параметры.Свойство("КассоваяСмена", ЭтотОбъект.ОтборКассоваяСмена);
	
	ЭтотОбъект.ОтборПериод.Вариант = ВариантСтандартногоПериода.Сегодня;
	
	ЗаполнитьТаблицыДанных();
	
	Элементы.ЧекКоррекции.Видимость = РольДоступна("ПолныеПрава")
		ИЛИ РольДоступна("ДобавлениеИзменениеДокументовПоОплате")
		ИЛИ РольДоступна("ДобавлениеИзменениеДокументовПоФинансам")
		ИЛИ РольДоступна("ЧтениеДокументовПоФинансам");
		
	Элементы.ОтчетПоВыручке.Видимость = Элементы.ЧекКоррекции.Видимость ИЛИ РольДоступна("ОтчетыПоДенежнымСредствам");
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "ОбработкаОповещения".
//
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновитьФормуУправленияКассовойСменой" Тогда
		ЗаполнитьТаблицыДанных();	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте  
// При изменении периода.
//
Процедура ОтборНачалоПериодаПриИзменении(Элемент)
	
	ЗаполнитьТаблицыДанных();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДанныеПоКассам

&НаКлиенте
// При активации ячейки.
//
Процедура ДанныеПоКассамПриАктивизацииЯчейки(Элемент)
	
	Элемент.ВыделенныеСтроки.Очистить();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДанныеПоЭквайрингам

&НаКлиенте
// При активации ячейки.
//
Процедура ДанныеПоЭквайрингамПриАктивизацииЯчейки(Элемент)
	
	Элемент.ВыделенныеСтроки.Очистить();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Выполнить печать Х-отчета.
//
Процедура ХОтчет(Элемент)
	
	Начало      = СтрНайти(Элемент.Имя, "_");
	НомерСтроки = Сред(Элемент.Имя,Начало + 1);
	
	ТекущиеДанные = ДанныеПоКассам[Число(НомерСтроки)];	
	ОповещениеПриЗавершении   = Новый ОписаниеОповещения("ОперацияЗавершение", ЭтотОбъект);
	ИдентификаторУстройстваФР = МенеджерОборудованияВызовСервера.ПолучитьИдентификаторФискальногоРегистратораДляКассы(ТекущиеДанные.Касса);
	ПараметрыОперации         = Новый Структура("Организация", ТекущиеДанные.Организация);
	
	МенеджерОборудованияКлиент.НачатьФормированиеОтчетаБезГашения(ОповещениеПриЗавершении, УникальныйИдентификатор, ПараметрыОперации, ИдентификаторУстройстваФР);

КонецПроцедуры

&НаКлиенте
// Закрытие смены, печать Z-отчета.
//
Процедура ZОтчет(Элемент)
	
	Начало      = СтрНайти(Элемент.Имя, "_");
	НомерСтроки = Сред(Элемент.Имя,Начало + 1);
	
	// Вызываем форму закрытия касссовй смены
	ТекущиеДанные = ДанныеПоКассам[Число(НомерСтроки)];	
	Если ТекущиеДанные.Открыта Тогда
		ОткрытьФорму("Документ.КассоваяСмена.Форма.ФормаЗакрытияКассовойСмены", Новый Структура("Касса", ТекущиеДанные.Касса),,,,, Новый ОписаниеОповещения("ZОтчетЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	Иначе
		ПараметрыОперации = Новый Структура;
		ИдентификаторУстройства = МенеджерОборудованияВызовСервера.ПолучитьИдентификаторФискальногоРегистратораДляКассы(ТекущиеДанные.Касса);		
		НомерТекущейСтроки = НомерСтроки;
		Если ЗначениеЗаполнено(ИдентификаторУстройства) Тогда                             			
			ПараметрыОперации = Новый Структура("Организация, Касса", ТекущиеДанные.Организация, ТекущиеДанные.Касса);
			Оповещение = Новый ОписаниеОповещения("ОткрытиеСменыЗавершение", ЭтотОбъект);
			МенеджерОборудованияКлиент.НачатьОткрытиеСменыНаФискальномУстройстве(Оповещение, УникальныйИдентификатор, ПараметрыОперации, ИдентификаторУстройства);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, закрытие кассовой смены завршение.
//
Процедура ОткрытиеСменыЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	Если РезультатВыполнения.Результат Тогда 
		
		ОписаниеОшибки = "";		
		ТекущиеДанные  = ДанныеПоКассам[Число(НомерТекущейСтроки)];
		Результат      = РозничныеПродажи.ОткрытьКассовуюСмену(ТекущиеДанные.Касса, ОписаниеОшибки);		
		
		Если Не Результат Тогда
			
			ТекстСообщения = НСтр("ru='При открытии смены произошла ошибка. Смена не открыта.
			                      |Дополнительное описание: %ДополнительноеОписание%';
								  |en='With opening shifts happened mistake. Change not isopen.
								  |Additional description: %ДополнительноеОписание%'");
			
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ДополнительноеОписание%", ОписаниеОшибки);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			
		Иначе			
			
			ЭтаФорма.Закрыть(Истина);
			
		КонецЕсли;		
		
	Иначе
		
		ТекстСообщения = НСтр("ru='При открытии смены произошла ошибка.
		                      |Смена не открыта на фискальном регистраторе.
							  |%ДополнительноеОписание%';
							  |en='With opening shifts happened mistake.
							  |Change is not isopen on fiscal registrar.
							  |%ДополнительноеОписание%'");
		
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ДополнительноеОписание%", РезультатВыполнения.ОписаниеОшибки);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
// Обработчик кнопки формирования выемки выручки.
//
Процедура ВыемкаВыручки(Элемент)
	
	Начало			= СтрНайти(Элемент.Имя, "_");
	НомерСтроки		= Сред(Элемент.Имя,	Начало + 1);	
	ТекущиеДанные	= ДанныеПоКассам[Число(НомерСтроки)];  
	
	Статья = Неопределено;
	ВидОперации = ОбщегоНазначения.ПолучитьЗначениеРеквизита(ТекущиеДанные.Касса, "ВыемкаИзКассы");   
	
	Если ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОпераций.СдачаНаличныхВБанк") Тогда                
		Статья = ПредопределенноеЗначение("Справочник.СтатьиДоходовИРасходов.СдачаНаличныхВБанк");
	ИначеЕсли ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОпераций.СдачаРозничнойВыручкиВКассуПредприятия") Тогда                
		Статья = ПредопределенноеЗначение("Справочник.СтатьиДоходовИРасходов.СдачаРозничнойВыручкиВКассуПредприятия");
	КонецЕсли;	
	
	ОткрытьФорму("Документ.КассоваяСмена.Форма.ФормаЗапросаСуммыОперации",
				Новый Структура("Инкассация, Касса, Статья", Истина, ТекущиеДанные.Касса, Статья),,,,,
				Новый ОписаниеОповещения("ВыемкаВыручкиЗавершение", ЭтотОбъект, ТекущиеДанные),
				РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	 
КонецПроцедуры

&НаКлиенте
// Обработчик поступления в кассу предприятия.
//
Процедура ПоступлениеВКассу(Элемент)
	
	Начало     		= СтрНайти(Элемент.Имя, "_");
	НомерСтроки 	= Сред(Элемент.Имя, Начало + 1);	
	ТекущиеДанные 	= ДанныеПоКассам[Число(НомерСтроки)];
		
	ОткрытьФорму("Документ.КассоваяСмена.Форма.ФормаЗапросаСуммыОперации",
			Новый Структура("ПрочееПоступление, Касса", Истина, ТекущиеДанные.Касса),,,,,
			Новый ОписаниеОповещения("ПоступлениеВКассуЗавершение", ЭтотОбъект, ТекущиеДанные),
			РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

КонецПроцедуры

&НаКлиенте
// Обработчик поступления в кассу предприятия.
//
Процедура ВыполнитьСверкуИтогов(Элемент)
	
	 Начало     = СтрНайти(Элемент.Имя, "_");
	 НомерСтроки = Сред(Элемент.Имя,Начало + 1);	
	
	 ТекущиеДанные = ДанныеПоЭквайрингам[Число(НомерСтроки)];
	
	 Если ТекущиеДанные <> Неопределено Тогда
		МенеджерОборудованияКлиент.ВыполнитьСверкуИтоговЭквайринг(ТекущиеДанные.Эквайринг, ЭтаФорма.УникальныйИдентификатор); 	
	 КонецЕсли;    
	
 КонецПроцедуры   
 
 &НаКлиенте
// Обработчик поступления в кассу предприятия
Процедура НапечататьПоследнийСлип(Элемент)
	
	 Начало     = СтрНайти(Элемент.Имя, "_");
	 НомерСтроки = Сред(Элемент.Имя,Начало + 1);	
	
	 ТекущиеДанные = ДанныеПоЭквайрингам[Число(НомерСтроки)];
	 
	Если ТекущиеДанные <> Неопределено Тогда
		МенеджерОборудованияКлиент.НапечататьПоследнийСлипЧекЭкварийнг(ЭтаФорма.УникальныйИдентификатор); 	
	КонецЕсли;	
	
КонецПроцедуры


&НаКлиенте
// Процедура  - обработчик команды "ОтчетПоВыручке".
//
Процедура ОтчетПоВыручке(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СформироватьАвтоматически"	, Истина);
	ПараметрыФормы.Вставить("НачалоПериода"            	, НачалоДня(ТекущаяДата()));
	ПараметрыФормы.Вставить("КонецПериода"             	, КонецДня(ТекущаяДата()));
	ПараметрыФормы.Вставить("КлючВарианта"				, ВернутьВариантОтчета());
	
	Если ДанныеПоКассам.Количество() > 0 Тогда
		ПараметрыФормы.Вставить("ДанныеПоКассам"		, ДанныеПоКассам[0].Касса);	
	КонецЕсли;
	
	ОткрытьФорму("Отчет.ОтчетПоВыручке.Форма", ПараметрыФормы);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбработкаОповещений

&НаКлиенте
// Процедура, обработчик завершения операции х отчета.
//
Процедура ОперацияЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	Если Не РезультатВыполнения.Результат Тогда
		ТекстСообщения = РезультатВыполнения.ОписаниеОшибки;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, завершения закрытия смены.
//
Процедура ZОтчетЗавершение(Результат, Параметры) Экспорт
	
	Если Результат = Истина Тогда
		ЭтаФорма.Закрыть(Истина);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик завершения выемки из кассы.
//
Процедура ВыемкаВыручкиЗавершение(Результат, Параметры) Экспорт
	
	ТекущиеДанные = Параметры;
	Если ТипЗнч(Результат) = Тип("Структура") И Результат.Свойство("СуммаДокумента") И Результат.СуммаДокумента > 0 Тогда 				
		// 1. Формирование документов выемки из кассы.
		ОписаниеОшибки  = Неопределено;
		РезультатВыемки = РозничныеПродажи.СформироватьВыемкуИзКассы(Результат, ОписаниеОшибки);
		Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
			
			ТекстСообщения = НСтр("ru='При выемке денег произошла ошибка.
			                      |Дополнительное описание: %ДополнительноеОписание%';
								  |en='With the notch of money happened mistake.
								  |Additional description: %ДополнительноеОписание%'");
			
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ДополнительноеОписание%", ОписаниеОшибки);			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Иначе
			ДокументВыемки = РезультатВыемки.ДокВыемки;
			
			СтатусФР = РозничныеПродажи.ПроверитьИспользованиеФРвКассе(ТекущиеДанные.Касса);		
			Если СтатусФР И ЗначениеЗаполнено(ДокументВыемки) Тогда
				// 2. Выполняем команду выемки на ФР
				ИдентификаторУстройстваФР = МенеджерОборудованияВызовСервера.ПолучитьИдентификаторФискальногоРегистратораДляКассы(ТекущиеДанные.Касса);
				
				ПараметрыОперации = Новый Структура;
				ПараметрыОперации.Вставить("ТипИнкассации"	, 0);
				ПараметрыОперации.Вставить("Сумма"			, Результат.СуммаДокумента);
				ПараметрыОперации.Вставить("Документ"		, ДокументВыемки);
				ПараметрыОперации.Вставить("Организация"	, ТекущиеДанные.Организация);     				
				ПараметрыОперации.Вставить("Касса"			, ТекущиеДанные.Касса);
				
				ОповещениеПриЗавершении = Новый ОписаниеОповещения("ИнкассацияНаФискальномУстройствеЗавершение", ЭтотОбъект);
				МенеджерОборудованияКлиент.НачатьИнкассациюНаФискальномУстройстве(
																	ОповещениеПриЗавершении,
																	УникальныйИдентификатор,
																	ПараметрыОперации,
																	ИдентификаторУстройстваФР);			
			КонецЕсли;			
		КонецЕсли;			
	КонецЕсли;
	
	ЗаполнитьИнформациюПоКассам();
	
КонецПроцедуры

&НаКлиенте
// Процедура, выполняет поступление денег в кассу завершение.
//
Процедура ПоступлениеВКассуЗавершение(Результат, Параметры) Экспорт
	
	ТекущиеДанные = Параметры;
	Если ТипЗнч(Результат) = Тип("Структура") И Результат.Свойство("СуммаДокумента") И Результат.СуммаДокумента > 0 Тогда 				
		
		ОписаниеОшибки   = Неопределено;
		ПараметрыИспользованияКассовойСмены = Новый Структура("ТекущиеДанные, СтруктураДанных", ТекущиеДанные, Результат);
		РозничныеПродажиКлиент.ВыполнитьКонтрольИспользованияКассовойСмены(ЭтотОбъект, ТекущиеДанные.Касса, ПараметрыИспользованияКассовойСмены, ОписаниеОшибки);
		
	Иначе 
		ЗаполнитьИнформациюПоКассам();
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик завершения выемки из кассы.
//
Процедура ИнкассацияНаФискальномУстройствеЗавершение(РезультатВыполнения, Параметры) Экспорт
		
	Если РезультатВыполнения.Результат Тогда		
		// Если чек пробился, то возвращаем номер чека ккм в документ (по умолчанию 88888888).
		НомерЧека = 88888888;
		РозничныеПродажи.ЗаписатьНомерЧекаВДокумент(РезультатВыполнения.Документ, НомерЧека);
		
		// Обновление отображения данных.
		ЗаполнитьТаблицыДанных();                                                                                  		
	Иначе
		ТекстСообщения = НСтр("ru='При выполнении операции произошла ошибка.
		|Чек не напечатан на фискальном устройстве.
		|Дополнительное описание: %ДополнительноеОписание%';
		|en='With performing operations happened mistake.
		|Check not printedby on fiscal device.
		|Additional description: %ДополнительноеОписание%'");
		
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ДополнительноеОписание%", РезультатВыполнения.ОписаниеОшибки);		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОБРАБОТЧИКИ_ДЛЯ_РАБОТЫ_С_КАССОВОЙ_СМЕНОЙ

&НаКлиенте
// Процедура - После контроля использования кассовой смены.
//
// Параметры:
//  ИспользованиеКассовойСменыРазрешено	 - 	 - 
//  ПараметрыИспользованияКассовойСмены	 - 	 - 
//  ОписаниеОшибки						 - 	 - 
//
Процедура ПослеКонтроляИспользованияКассовойСмены(ИспользованиеКассовойСменыРазрешено, ПараметрыИспользованияКассовойСмены, ОписаниеОшибки) Экспорт 
	
	Если ИспользованиеКассовойСменыРазрешено = Ложь Тогда
		ПоказатьПредупреждение(, ОписаниеОшибки);
		Возврат;
	КонецЕсли;
	
	// 1. Формирование документов поступления денег в кассу.
	ОписаниеОшибки  = Неопределено;
	РезультатВыемки = РозничныеПродажи.СформироватьПоступлениеВОперационнуюКассуИзкассыПредприятия(ТекущаяДата(), ПараметрыИспользованияКассовойСмены.СтруктураДанных, ОписаниеОшибки);
	Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
		
		ТекстСообщения = НСтр("ru='При поступление денег произошла ошибка.
		                      |Дополнительное описание: %ДополнительноеОписание%';
							  |en='With receipt of money happened mistake.
		                      |Additional description: %ДополнительноеОписание%'");
		
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ДополнительноеОписание%", ОписаниеОшибки);			
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	Иначе
		ДокументПоступления = РезультатВыемки.ДокПоступления;
		
		СтатусФР = РозничныеПродажи.ПроверитьИспользованиеФРвКассе(ПараметрыИспользованияКассовойСмены.ТекущиеДанные.Касса);		
		Если СтатусФР И ЗначениеЗаполнено(ДокументПоступления) Тогда
			// 2. Выполняем команду поступления денег на ФР
			ИдентификаторУстройстваФР = МенеджерОборудованияВызовСервера.ПолучитьИдентификаторФискальногоРегистратораДляКассы(ПараметрыИспользованияКассовойСмены.ТекущиеДанные.Касса);
			
			ПараметрыОперации = Новый Структура;
			ПараметрыОперации.Вставить("ТипИнкассации"	, 1);
			ПараметрыОперации.Вставить("Сумма"			, ПараметрыИспользованияКассовойСмены.СтруктураДанных.СуммаДокумента);
			ПараметрыОперации.Вставить("Документ"		, ДокументПоступления);
			ПараметрыОперации.Вставить("Организация"	, ПараметрыИспользованияКассовойСмены.ТекущиеДанные.Организация);
			ПараметрыОперации.Вставить("Касса"	  		, ПараметрыИспользованияКассовойСмены.ТекущиеДанные.Касса);
			
			ОповещениеПриЗавершении = Новый ОписаниеОповещения("ИнкассацияНаФискальномУстройствеЗавершение", ЭтотОбъект);
			МенеджерОборудованияКлиент.НачатьИнкассациюНаФискальномУстройстве(ОповещениеПриЗавершении, УникальныйИдентификатор, ПараметрыОперации, ИдентификаторУстройстваФР);			
		КонецЕсли;			
	КонецЕсли;					
	
	ЗаполнитьИнформациюПоКассам();
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция возвращает вариант отчета
//
Функция ВернутьВариантОтчета()
	
	Если НЕ Константы.НесколькоВрачейВОдномПриеме.Получить() Тогда 
		Возврат "Основной";
	Иначе 
		Возврат "Основной_БЕЗ_ДЕТАЛИЗАЦИИ_ПО_СОТРУДНИКАМ";
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область ДополнительныеПроцедурыФункции

&НаСервере
// Функция - Заполнить информацию по кассам
// 
// Возвращаемое значение:
//   - 
//
Функция ЗаполнитьИнформациюПоКассам()
	
	ОтборКассы = Неопределено;
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ОтборКассоваяСмена) Тогда
	 	ОтборКассы = Справочники.Кассы.ПолучитьКассыДляОплаты(СтруктурнаяЕдиница);		
	Иначе
		ОтборКассы = Новый Массив;
		ОтборКассы.Добавить(ЭтотОбъект.ОтборКассоваяСмена.Касса);
	КонецЕсли;
	 	
	ДанныеПоКассам.Очистить();
	
	Счетчик = 1;
	Для Каждого Касса Из ОтборКассы Цикл
		
		СтатусФр = РозничныеПродажи.ПроверитьИспользованиеФРвКассе(Касса);
				
		ДатаВремяНачалаОтбора = Неопределено;
		ДатаВремяКонцаОтбора  = Неопределено;

		Если СтатусФр = Истина И ОтборПериод.Вариант = ВариантСтандартногоПериода.Сегодня Тогда
			
			ДокКассовойСмены = ПолучитьДокументКассовойСмены(Касса, ОтборПериод.ДатаОкончания);
			
			Если ЗначениеЗаполнено(ДокКассовойСмены) Тогда
				
				Если ДокКассовойСмены.СтатусыКассовойСмены = Перечисления.СтатусыКассовойСмены.Открыта Тогда
					
					ДатаВремяНачалаОтбора = ДокКассовойСмены.НачалоКассовойСмены;
					ДатаВремяКонцаОтбора  = ?(ЗначениеЗаполнено(ДокКассовойСмены.ОкончаниеКассовойСмены), ДокКассовойСмены.ОкончаниеКассовойСмены, КонецДня(ОтборПериод.ДатаОкончания));
					
				Иначе
					
					ДатаВремяНачалаОтбора = ДокКассовойСмены.ОкончаниеКассовойСмены;
					
					Если ОтборПериод.ДатаОкончания > ДатаВремяНачалаОтбора Тогда
						
						ДатаВремяКонцаОтбора = ОтборПериод.ДатаОкончания;
						
					Иначе
						
						ДатаВремяКонцаОтбора = КонецДня(ТекущаяДатаСеанса());
						
						Если ДатаВремяНачалаОтбора > ДатаВремяКонцаОтбора Тогда
							ДатаВремяНачалаОтбора = НачалоДня(ТекущаяДатаСеанса());		
						КонецЕсли;
						
					КонецЕсли;

				КонецЕсли;
			
			КонецЕсли;	
			
		КонецЕсли;
		
		// Если ДатаВремяНачалаОтбора = Неопределено Тогда
		//	
		//	ВремяРаботыСЕ = Справочники.СтруктурныеЕдиницы.ВремяРаботыСтруктурнойЕдиницы(ОтборПериод.ДатаНачала, ЭтотОбъект.СтруктурнаяЕдиница, ДеньНедели(ОтборПериод.ДатаНачала));
		//	
		//	Если ВремяРаботыСЕ <> Неопределено Тогда
		//		
		//		ДатаВремяНачалаОтбора = ОбщегоНазначенияСтоматология.СложитьДатуИВремя(ОтборПериод.ДатаНачала, ВремяРаботыСЕ.НачалоРаботы);
		//		ДатаВремяКонцаОтбора  = ОбщегоНазначенияСтоматология.СложитьДатуИВремя(ОтборПериод.ДатаОкончания, ВремяРаботыСЕ.ОкончаниеРаботы);
		//		
		//	Иначе
				
				ДатаВремяНачалаОтбора = ОтборПериод.ДатаНачала;
				ДатаВремяКонцаОтбора  = ОтборПериод.ДатаОкончания;
				
		//	КонецЕсли;
		//				
		// КонецЕсли;	
		
		ВыборкаПоКассам = ПолучитьДанныеПоКассовойСмены(Касса, ДатаВремяНачалаОтбора, ДатаВремяКонцаОтбора);
		
		Если ВыборкаПоКассам.Следующий() Тогда
			
			НоваяСтрока = ДанныеПоКассам.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаПоКассам);	
			
			Если СтатусФр = Истина 
				И ЗначениеЗаполнено(ВыборкаПоКассам.ДатаВремяОткрытияСмены) Тогда
				
				НоваяСтрока.ВремяОткрытияСмены          = Формат(ВыборкаПоКассам.ДатаВремяОткрытияСмены, "ДФ='dd.MM.yyyy HH:mm'" );
				НоваяСтрока.ВремяОткрытияСменыЗаголовок = ?(Счетчик = 1, НСтр("ru= 'открыта';en ='open'"), "");
				НоваяСтрока.Открыта                     = Истина;
				
			КонецЕсли;
			
			Если Счетчик = 1 Тогда 
				
				НоваяСтрока.НачальныйОстатокЗаголовок = НСтр("ru= 'начало';en ='start'");
				НоваяСтрока.КонечныйОстатокЗаголовок  = НСтр("ru= 'конец';en ='end'");
				НоваяСтрока.ПриходЗаголовок           = НСтр("ru= 'приход';en ='coming'");
				НоваяСтрока.РасходЗаголовок           = НСтр("ru= 'расход';en ='consumption'");
				
			КонецЕсли;
			
		КонецЕсли;
		
		Счетчик = Счетчик + 1;
		
	КонецЦикла;
	
	Элементы.ДанныеПоКассам.ВысотаВСтрокахТаблицы = ДанныеПоКассам.Количество();	
	
	ИтогПоКассамНачальныйОстаток = ДанныеПоКассам.Итог("НачальныйОстаток");
	ИтогПоКассамКонечныйОстаток  = ДанныеПоКассам.Итог("КонечныйОстаток");
    ИтогПоКассамПриход           = ДанныеПоКассам.Итог("Приход");
    ИтогПоКассамРасход           = ДанныеПоКассам.Итог("Расход");
	
	Возврат ОтборКассы;
	
КонецФункции

&НаСервере
// Заполнить дерево данных.
//
Процедура ЗаполнитьТаблицыДанных()
	
	ОтборКассы = ЗаполнитьИнформациюПоКассам();
	
	МаксКолКнопокПоКассам = 0;
	СоздатьДинамическиеКнопкиОперацииСФР(МаксКолКнопокПоКассам);
	
	// Заполнение данных по эквайрингам	
	ЭквайринговыеТерминалы = Справочники.ЭквайринговыеТерминалы.ПолучитьЭквайринговыеТерминалыДляРабочегоМеста(ОтборКассы, РабочееМесто);
	ДанныеПоЭквайрингам.Очистить();
	
	Счетчик = 1;
	Для Каждого ЭквТерминал ИЗ ЭквайринговыеТерминалы Цикл
		
		// Предложено Денисом, что бы не давать пользователю 
		// права на чтение контрагентов(для параметра "БанковскийСчет")
		УстановитьПривилегированныйРежим(Истина);
		
		ДвиженияПоЭквайрингу = Новый Запрос(
		"ВЫБРАТЬ
		|	РасчетыПоЭквайрингуОстаткиИОбороты.ЭквайринговыйТерминал КАК ЭквайринговыйТерминал,
		|	СУММА(РасчетыПоЭквайрингуОстаткиИОбороты.СуммаПриход) КАК Приход,
		|	СУММА(РасчетыПоЭквайрингуОстаткиИОбороты.СуммаРасход) КАК Расход
		|ИЗ
		|	РегистрНакопления.РасчетыПоЭквайрингу.ОстаткиИОбороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			Авто,
		|			,
		|			ЭквайринговыйТерминал В (&ЭквТерминал)
		|				И ТипДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.ПлатежнаяКарта)) КАК РасчетыПоЭквайрингуОстаткиИОбороты
		|ГДЕ
		|	(РасчетыПоЭквайрингуОстаткиИОбороты.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОпераций.ОплатаОтКЛиента)
		|			ИЛИ РасчетыПоЭквайрингуОстаткиИОбороты.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОпераций.ВозвратОшибочнойОплатыКлиенту)
		|			ИЛИ РасчетыПоЭквайрингуОстаткиИОбороты.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОпераций.ВозвратОплатыКлиенту)
		|			ИЛИ РасчетыПоЭквайрингуОстаткиИОбороты.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОпераций.ВзносНаЛицевойСчет)
		|			ИЛИ РасчетыПоЭквайрингуОстаткиИОбороты.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОпераций.ВозвратСЛицевогоСчета))
		|
		|СГРУППИРОВАТЬ ПО
		|	РасчетыПоЭквайрингуОстаткиИОбороты.ЭквайринговыйТерминал");
		
		ДвиженияПоЭквайрингу.УстановитьПараметр("НачалоПериода", ОтборПериод.ДатаНачала);
		ДвиженияПоЭквайрингу.УстановитьПараметр("КонецПериода" , ОтборПериод.ДатаОкончания);
		ДвиженияПоЭквайрингу.УстановитьПараметр("ЭквТерминал"  , ЭквТерминал);
		
		ОстаткиПоЭкв = ДвиженияПоЭквайрингу.Выполнить().Выгрузить();
		
		УстановитьПривилегированныйРежим(Ложь);

		НоваяСтрока           = ДанныеПоЭквайрингам.Добавить();
		НоваяСтрока.Эквайринг = ЭквТерминал;
		Если ОстаткиПоЭкв.Количество() > 0 Тогда
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ОстаткиПоЭкв[0]);
		КонецЕсли;
		
		Если Счетчик = 1 Тогда 
			НоваяСтрока.ПриходЗаголовок = НСтр("ru= 'приход';en ='coming'");
			НоваяСтрока.РасходЗаголовок = НСтр("ru= 'расход';en ='consumption'");
		КонецЕсли;
		
		Счетчик = Счетчик + 1;
	
	КонецЦикла;
		
	СоздатьДинамическиеКнопкиОперацииЭквайринга(МаксКолКнопокПоКассам);
	
	Если ДанныеПоЭквайрингам.Количество() > 0 Тогда
		Элементы.ГруппаДанныеПоЭквайрингам.Видимость = Истина;
		Элементы.ДанныеПоЭквайрингам.ВысотаВСтрокахТаблицы = ДанныеПоЭквайрингам.Количество();
	Иначе
		Элементы.ГруппаДанныеПоЭквайрингам.Видимость = Ложь;
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
// Функция - Получить данные по кассовой смены.
//
// Параметры:
//  Касса			 - 	 - 
//  ДатаНачала		 - 	 - 
//  ДатаОкончания	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьДанныеПоКассовойСмены(Касса, ДатаНачала, ДатаОкончания)
	
	ДвиженияПоКассам = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВложенныйЗапрос.Касса КАК Касса,
	|	ВложенныйЗапрос.Касса.Организация КАК Организация,
	|	СУММА(ВложенныйЗапрос.НачальныйОстаток) КАК НачальныйОстаток,
	|	СУММА(ВложенныйЗапрос.КонечныйОстаток) КАК КонечныйОстаток,
	|	СУММА(ВложенныйЗапрос.Приход) КАК Приход,
	|	СУММА(ВложенныйЗапрос.Расход) КАК Расход,
	|	ВложенныйЗапрос.НачалоКассовойСмены КАК ДатаВремяОткрытияСмены
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДенежныеСредстваОстаткиИОбороты.БанковскийСчетКасса КАК Касса,
	|		ДенежныеСредстваОстаткиИОбороты.СуммаНачальныйОстаток КАК НачальныйОстаток,
	|		ДенежныеСредстваОстаткиИОбороты.СуммаКонечныйОстаток КАК КонечныйОстаток,
	|		ДенежныеСредстваОстаткиИОбороты.СуммаПриход КАК Приход,
	|		ДенежныеСредстваОстаткиИОбороты.СуммаРасход КАК Расход,
	|		КассоваяСмена.НачалоКассовойСмены КАК НачалоКассовойСмены
	|	ИЗ
	|		РегистрНакопления.ДенежныеСредства.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, , , БанковскийСчетКасса = &Касса) КАК ДенежныеСредстваОстаткиИОбороты
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.КассоваяСмена КАК КассоваяСмена
	|			ПО ДенежныеСредстваОстаткиИОбороты.БанковскийСчетКасса = КассоваяСмена.Касса
	|				И (КассоваяСмена.Проведен = ИСТИНА)
	|				И (КассоваяСмена.СтатусыКассовойСмены = ЗНАЧЕНИЕ(Перечисление.СтатусыКассовойСмены.Открыта))
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Кассы.Ссылка,
	|		0,
	|		0,
	|		0,
	|		0,
	|		КассоваяСмена.НачалоКассовойСмены
	|	ИЗ
	|		Справочник.Кассы КАК Кассы
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.КассоваяСмена КАК КассоваяСмена
	|			ПО Кассы.Ссылка = КассоваяСмена.Касса
	|				И (КассоваяСмена.СтатусыКассовойСмены = ЗНАЧЕНИЕ(Перечисление.СтатусыКассовойСмены.Открыта))
	|				И (КассоваяСмена.Проведен = ИСТИНА)
	|	ГДЕ
	|		Кассы.Ссылка = &Касса
	|		И Кассы.ПометкаУдаления = ЛОЖЬ) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Касса,
	|	ВложенныйЗапрос.НачалоКассовойСмены,
	|	ВложенныйЗапрос.Касса.Организация");
	
	ДвиженияПоКассам.УстановитьПараметр("НачалоПериода", ДатаНачала);
	ДвиженияПоКассам.УстановитьПараметр("КонецПериода" , ДатаОкончания);
    ДвиженияПоКассам.УстановитьПараметр("Касса"        , Касса);
	
	Возврат ДвиженияПоКассам.Выполнить().Выбрать();
	
КонецФункции

&НаСервере
// Функция - Получить документ кассовой смены.
//
// Параметры:
//  Касса		 - 	 - 
//  ДатаОтбора	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьДокументКассовойСмены(Касса, ДатаОтбора)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	КассоваяСмена.Ссылка КАК КассоваяСмена
	|ИЗ
	|	Документ.КассоваяСмена КАК КассоваяСмена
	|ГДЕ
	|	КассоваяСмена.НачалоКассовойСмены <= &ДатаОтбора
	|	И КассоваяСмена.Проведен = ИСТИНА
	|	И КассоваяСмена.Касса = &Касса
	|
	|УПОРЯДОЧИТЬ ПО
	|	КассоваяСмена.НачалоКассовойСмены УБЫВ");
	
	Запрос.УстановитьПараметр("Касса"     , Касса);
	Запрос.УстановитьПараметр("ДатаОтбора", ДатаОтбора);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат ?(Выборка.Следующий(), Выборка.КассоваяСмена, Неопределено);
	
КонецФункции

&НаСервере
// Создать динамические элементы.
//
Процедура СоздатьДинамическиеКнопкиОперацииСФР(МаксКолКнопок = 0)
	
	ОснГруппа = Элементы.ГруппаДинамическиеКнопки;
	Пока ОснГруппа.ПодчиненныеЭлементы.Количество() > 1 Цикл
		Элементы.Удалить(ОснГруппа.ПодчиненныеЭлементы[1]);
	КонецЦикла;
	
	КолЭлементов = ДанныеПоКассам.Количество();
	Для А = 0 По КолЭлементов - 1 Цикл
		
		НоваяГруппа             = Элементы.Добавить("ГруппаКнопок_" + А, Тип("ГруппаФормы"), ОснГруппа);
		НоваяГруппа.Вид 		= ВидГруппыФормы.ОбычнаяГруппа;
		НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
		НоваяГруппа.ОтображатьЗаголовок = Ложь;
		// НоваяГруппа.ГоризонтальноеПоложениеПодчиненных = ГоризонтальноеПоложениеЭлемента.Лево;

		// Декорация касса открыта
		ДекВыемка          = Элементы.Добавить("ДекорацияКассаОткрыта_" + А,Тип("ДекорацияФормы"), НоваяГруппа);
		ДекВыемка.Вид      = ВидДекорацииФормы.Картинка;
		ДекВыемка.Картинка = ?(ДанныеПоКассам[А].Открыта, БиблиотекаКартинок.КассаОткрыта, БиблиотекаКартинок.Пустая);
		// ДекВыемка.Гиперссылка = Истина;
		ДекВыемка.Подсказка = ?(ДанныеПоКассам[А].Открыта, НСтр("ru= 'Касса открыта';en ='Cash desk is open'"), "");
		ДекВыемка.Высота   = 2;
		ДекВыемка.Ширина   = 5;
		// ДекВыемка.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Лево; 
		// ДекВыемка.УстановитьДействие("Нажатие","ВыемкаВыручки");
		
		// Кнопка выемки из кассы
		ДекВыемка          = Элементы.Добавить("ДекорацияВыемкаВыручки_" + А,Тип("ДекорацияФормы"), НоваяГруппа);
		ДекВыемка.Вид      = ВидДекорацииФормы.Картинка;
		ДекВыемка.Картинка = БиблиотекаКартинок.ВыемкаВыручкиИзОперационнойКассы32;
		ДекВыемка.Гиперссылка = Истина;
		ДекВыемка.Подсказка = НСтр("ru= 'Выемка выручки в кассу предприятия';en ='Revenues to the cash desk of the enterprise'");
		ДекВыемка.Высота   = 2;
		ДекВыемка.Ширина   = 5;
		// ДекВыемка.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Лево; 
		ДекВыемка.УстановитьДействие("Нажатие","ВыемкаВыручки");
		
	    // Кнопка поступления в кассу
		ДекПоступления          = Элементы.Добавить("ДекорацияПоступлениеВКассу_" + А,Тип("ДекорацияФормы"), НоваяГруппа);
		ДекПоступления.Вид      = ВидДекорацииФормы.Картинка;
		ДекПоступления.Картинка = БиблиотекаКартинок.ПоступлениеВОперационнуюКассу32;
		ДекПоступления.Гиперссылка = Истина;
		ДекПоступления.Подсказка = НСтр("ru= 'Поступление в операционную кассу из кассы предприятия';en ='Receipt to the operating cash desk from the cash desk of the enterprise'");
		ДекПоступления.Высота   = 2;
		ДекПоступления.Ширина   = 5;
		ДекПоступления.УстановитьДействие("Нажатие","ПоступлениеВКассу");
		
		МаксКолКнопок = ?(МаксКолКнопок > 2, МаксКолКнопок, 2);
		СтатусФр = РозничныеПродажи.ПроверитьИспользованиеФРвКассе(ДанныеПоКассам[А].Касса, РабочееМесто);
		Если СтатусФр = Истина Тогда
			
			// Кнопка Z-отчета
			ДекZОтчета          = Элементы.Добавить("ДекорацияZОтчета_" + А,Тип("ДекорацияФормы"), НоваяГруппа);
			ДекZОтчета.Вид      = ВидДекорацииФормы.Картинка;
			Если ДанныеПоКассам[А].Открыта Тогда
				ДекZОтчета.Картинка = БиблиотекаКартинок.ZОтчет32;			
				ДекZОтчета.Подсказка = НСтр("ru= 'Закрыть смену, Z-отчет';en ='Close shift, Z-report'");
			Иначе
				ДекZОтчета.Картинка = БиблиотекаКартинок.ОткрытьКассовуюСмену32;			
				ДекZОтчета.Подсказка = НСтр("ru= 'Открыть смену';en ='Open shift'");
			КонецЕсли;
			ДекZОтчета.Гиперссылка = Истина;
			ДекZОтчета.Высота   = 2;
			ДекZОтчета.Ширина   = 5;
			ДекZОтчета.УстановитьДействие("Нажатие","ZОтчет");
			
			// Кнопка X-отчета
			ДекXОтчета             = Элементы.Добавить("ДекорацияXОтчета_" + А,Тип("ДекорацияФормы"), НоваяГруппа);
			ДекXОтчета.Вид         = ВидДекорацииФормы.Картинка;
			ДекXОтчета.Гиперссылка = Истина;
			ДекXОтчета.Картинка    = БиблиотекаКартинок.XОтчет32;
			ДекXОтчета.Подсказка   = НСтр("ru= 'Вывести X-отчет';en ='Display X-report'");
			ДекXОтчета.Высота      = 2;
			ДекXОтчета.Ширина      = 5;
			ДекXОтчета.УстановитьДействие("Нажатие","ХОтчет");	
			
			МаксКолКнопок = 4;
		КонецЕсли;
	КонецЦикла;
	
	Если ОснГруппа.ПодчиненныеЭлементы.Количество() > 0 Тогда
		ДекЗаглушка = Элементы.Добавить("ДекорацияЗаглушка_999",Тип("ДекорацияФормы"), ОснГруппа);
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
// Создать динамические элементы.
//
Процедура СоздатьДинамическиеКнопкиОперацииЭквайринга(КолКнопокПоКассам)
	
	ОснГруппа = Элементы.ГруппаДинамическиеКнопкиЭквайринга;
	
	Пока ОснГруппа.ПодчиненныеЭлементы.Количество() > 1 Цикл		
		Элементы.Удалить(ОснГруппа.ПодчиненныеЭлементы[1]);		
	КонецЦикла;
	
	КолЭлементов = ДанныеПоЭквайрингам.Количество();
	Для А = 0 По КолЭлементов - 1 Цикл
		
		Если ЗначениеЗаполнено(ДанныеПоЭквайрингам[А].Эквайринг.ПодключаемоеОборудование) 
			И ДанныеПоЭквайрингам[А].Эквайринг.ИспользоватьБезПодключенияОборудования = Ложь
			И ЗначениеЗаполнено(ДанныеПоЭквайрингам[А].Эквайринг.ПодключаемоеОборудование.РабочееМесто) Тогда 
						
			НоваяГруппа             = Элементы.Добавить("ГруппаКнопокЭквайрнг_" + А, Тип("ГруппаФормы"), ОснГруппа);
			НоваяГруппа.Вид 		= ВидГруппыФормы.ОбычнаяГруппа;
			НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
			НоваяГруппа.ОтображатьЗаголовок = Ложь;
			
			// Кнопка выемки из кассы
			ДекСверкаИтогов          = Элементы.Добавить("ДекорацияВыполнитьСверкуИтогов_" + А,Тип("ДекорацияФормы"), НоваяГруппа);
			ДекСверкаИтогов.Вид      = ВидДекорацииФормы.Картинка;
			ДекСверкаИтогов.Картинка = БиблиотекаКартинок.СверкаИтоговЭквайринга32;
			ДекСверкаИтогов.Гиперссылка = Истина;
			ДекСверкаИтогов.Подсказка = НСтр("ru= 'Выполнить сверку итогов';en ='Reconcile totals'");
			ДекСверкаИтогов.Высота   = 2;
			ДекСверкаИтогов.Ширина   = 5;
			ДекСверкаИтогов.УстановитьДействие("Нажатие","ВыполнитьСверкуИтогов");
			
			// Кнопка поступления в кассу
			ДекНапечататьПослСлип          = Элементы.Добавить("ДекорацияНапечататьПоследнийСлип_" + А,Тип("ДекорацияФормы"), НоваяГруппа);
			ДекНапечататьПослСлип.Вид      = ВидДекорацииФормы.Картинка;
			ДекНапечататьПослСлип.Картинка = БиблиотекаКартинок.НапечататьПоследнийСлипЧек32;
			ДекНапечататьПослСлип.Гиперссылка = Истина;
			ДекНапечататьПослСлип.Подсказка = НСтр("ru= 'Напечатать последний слип';en ='Print last slip'");
			ДекНапечататьПослСлип.Высота   = 2;
			ДекНапечататьПослСлип.Ширина   = 5;
			ДекНапечататьПослСлип.УстановитьДействие("Нажатие","НапечататьПоследнийСлип");
			
			Если КолКнопокПоКассам = 4 Тогда
				ДекЗаглушка = Элементы.Добавить("ДекорацияЗаглушкаЭквайрнг_" + А,Тип("ДекорацияФормы"), НоваяГруппа);
				ДекЗаглушка.Высота   = 2;
				ДекЗаглушка.Ширина   = 11;			
			КонецЕсли;
			
		Иначе
			
			НоваяГруппа             = Элементы.Добавить("ГруппаКнопокЭквайрнг_" + А, Тип("ГруппаФормы"), ОснГруппа);
			НоваяГруппа.Вид 		= ВидГруппыФормы.ОбычнаяГруппа;
			НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
			НоваяГруппа.ОтображатьЗаголовок = Ложь;
			
			ДекСверкаИтогов          = Элементы.Добавить("ДекорацияВыполнитьСверкуИтогов_" + А,Тип("ДекорацияФормы"), НоваяГруппа);
			ДекСверкаИтогов.Вид      = ВидДекорацииФормы.Надпись;
			ДекСверкаИтогов.Заголовок = " ";
			ДекСверкаИтогов.Высота   = 3;
			ДекСверкаИтогов.Ширина   = 5;

			Если КолКнопокПоКассам = 4 Тогда
				ДекЗаглушка = Элементы.Добавить("ДекорацияЗаглушкаЭквайрнг_" + А,Тип("ДекорацияФормы"), НоваяГруппа);
				ДекЗаглушка.Высота   = 2;
				ДекЗаглушка.Ширина   = 11;			
			КонецЕсли;

		КонецЕсли;	
	КонецЦикла;
	
	Если ОснГруппа.ПодчиненныеЭлементы.Количество() > 0 Тогда
		
		ДекЗаглушка = Элементы.Добавить("ДекорацияЗаглушкаЭквайрнг_999999",Тип("ДекорацияФормы"), ОснГруппа);
		
	Иначе	
		Если КолКнопокПоКассам = 4 Тогда
			ДекЗаглушка = Элементы.Добавить("ДекорацияЗаглушкаЭквайрнг_99999",Тип("ДекорацияФормы"), ОснГруппа);
			ДекЗаглушка.Высота   = 2;
			ДекЗаглушка.Ширина   = 20;	
		Иначе			
			ДекЗаглушка = Элементы.Добавить("ДекорацияЗаглушкаЭквайрнг_99999",Тип("ДекорацияФормы"), ОснГруппа);
			ДекЗаглушка.Высота   = 2;
			ДекЗаглушка.Ширина   = 10;			
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды формы.
//
Процедура ЧекКоррекции(Команда)
	
	 ОткрытьФорму("ЖурналДокументов.ЖурналЧековКоррекции.Форма.ФормаСписка");	
	 
КонецПроцедуры

#КонецОбласти

#КонецОбласти
